#include <iostream>

using namespace std;

int main()
{
	// 연산자

	// 산술 연산자
	cout << "덧셈입니다 : " << 1 + 1 << endl;
	cout << "뺄셈입니다 : " << 3 - 2 << endl;
	cout << "곱셈입니다 : " << 5 * 2 << endl;
	cout << "나눗셈입니다 : " << 9 / 3 << endl;
	cout << "나눗셈입니다 : " << 6 / 4 << endl;
	cout << "나눗셈 나머지입니다 : " << 6 % 3 << endl;
	cout << "나눗셈 나머지입니다 : " << 6 % 4 << '\n' << endl;

	// 비교 연산자
	cout << "비교연산자입니다 (>) : " << (10 > 3) << endl;
	cout << "비교연산자입니다 (<) : " << (10 < 100) << endl;
	cout << "비교연산자입니다 (>=) : " << (10 >= 9) << endl;
	cout << "비교연산자입니다 (<=) : " << (10 <= 10) << endl;
	cout << "비교연산자입니다 (==) : " << (10 == 10) << endl;
	cout << "비교연산자입니다 (!=) : " << (10 != 10) << '\n' << endl;

	// 논리 연산자
	cout << "논리연산자입니다 (&&) : " << ((10 == 10) && (7 > 4)) << endl;
	cout << "논리연산자입니다 (&&) : " << ((10 == 10) && (7 < 4)) << endl;
	cout << "논리연산자입니다 (||) : " << ((10 == 10) || (7 > 4)) << endl;
	cout << "논리연산자입니다 (||) : " << ((10 == 10) || (7 < 4)) << endl;
	cout << "논리연산자입니다 (||) : " << ((10 != 10) || (7 < 4)) << '\n' << endl;


	//===================================================================


	// if - statement
	if (true)
	{
		cout << "첫번째 조건이 참입니다." << '\n' << endl;
	}
	else if (true)
	{
		cout << "두번째 조건이 참입니다." << '\n' << endl;
	}
	else
	{
		cout << "모든 조건이 일치하지 않습니다." << '\n' << endl;
	}


	//===================================================================


	// 반복문

	// for문
	for (int i = 1; i < 6; i++)
	{
		cout << i << "번째 안녕!" << endl;
	}
	std::cout << '\n';

	// while문
	int  i = 1;

	while (i < 6)
	{
		cout << i << "번째 안녕!" << endl;
		i++;
	}

	return 0;
}